import { PriceCardProps } from "@/types"
import PriceCard from "../molecules/PriceCard"

const priceCards = [
  {
    title: "باقة برو",
    numberOfEmp: 1,
    options: [
      {
        title: "عدد قنوات التواصل : 2",
        items: [
          "واتساب الأعمال الرسمي API",
          "الفيسبوك والإنستقرام",
          "ربط البريد الإلكتروني",
          "المحادثة المباشرة في الموقع",
          "التيلقرام",
          "الربط مع اي منصة عبر API"
        ]
      },
      {
        title: "جميع المميزات الاساسية",
        items: [
          "الأتمتة والرد الآلي",
          "تنسيق العمل وادارة الفريق",
          "تطبيق الجوال IOS & Android",
          "جميع التحليلات والتقارير",
          "الإجرائات & الردود السريعة",
          "واجهة ادارة التطبيقات API"
        ]
      },
      { title: "ارسال واستلام رسائل غير محدود", items: [] },
      { title: "لا حدود على جهات الاتصال", items: [] },
      { title: "خدمة دعم فني عربي", items: [] }
    ],
    price: "49"
  },
  {
    title: "أعمال",
    numberOfEmp: 5,
    options: [
      {
        title: "عدد قنوات التواصل: 5",
        items: [
          "واتساب الأعمال الرسمي API",
          "الفيسبوك والإنستقرام",
          "ربط البريد الإلكتروني",
          "المحادثة المباشرة في الموقع",
          "التيلقرام",
          "الربط مع اي منصة عبر API"
        ]
      },
      {
        title: "حميع مميزات باقة برو +",
        items: [
          "نظام توزيع محادثات ذكي للموظفين",
          "رد آلي متقدم ازرار تفاعلية + قوائم تفاعلية",
          "مزامنة بيانات العملاء مع الموقع او التطبيق",
          " رسائل جماعية/تسويقية عبر الواتساب"
        ]
      },
      { title: "ارسال واستلام رسائل غير محدود", items: [] },
      { title: "لا حدود على جهات الاتصال", items: [] },
      { title: "دعم فني عربي", items: [] }
    ],
    price: "99",
    isActive: true
  },
  {
    title: "أعمال برو",
    numberOfEmp: 15,
    options: [
      {
        title: "عدد قنوات تواصل غير محدود",
        items: [
          "واتساب الأعمال الرسمي API",
          "الفيسبوك والإنستقرام",
          "ربط البريد الإلكتروني",
          "المحادثة المباشرة في الموقع",
          "التيلقرام",
          "الربط مع اي منصة عبر API"
        ]
      },
      {
        title: "حميع مميزات باقة برو +",
        items: [
          "نظام توزيع محادثات ذكي للموظفين",
          "رد آلي متقدم ازرار تفاعلية + قوائم تفاعلية",
          "مزامنة بيانات العملاء مع الموقع او التطبيق",
          " رسائل جماعية/تسويقية عبر الواتساب"
        ]
      },
      { title: "ارسال واستلام رسائل غير محدود", items: [] },
      { title: "لا حدود على جهات الاتصال", items: [] },
      { title: "دعم فني عربي", items: [] }
    ],
    price: "399"
  }
]
function HomePricing() {
  return (
    <div className="flex flex-col items-center mt-14 w-5/6 mx-auto">
      <h1 className="text-4xl font-extrabold">تسعير بسيط وشفاف</h1>
      <h3 className="text-lg font-semibold text-gray-700">
        لا اجور اضافية او حدود على المحادثات والرسائل او مميزات المنصة الرئيسية
        في جميع الباقات
      </h3>
      <div className="grid grid-cols-1 md:grid-cols-3 mt-24 mb-8 gap-8">
        {priceCards?.map((card: PriceCardProps, index: number) => (
          <PriceCard {...card} key={index} />
        ))}
      </div>
    </div>
  )
}

export default HomePricing
